[
  {
    "image": "https://images.unsplash.com/photo-1517430816045-df4b7de11d1d",
    "title": "Focusly: Productivity Timer",
    "companyName": "MindSpark Labs",
    "id": 1,
    "description": "Focusly helps you build consistent focus through structured Pomodoro sessions. Track your productive hours, analyze weekly trends, and discover how small habits lead to big results. With ambient nature sounds and minimal design, Focusly keeps distractions away and motivation high. You can customize session durations, short and long breaks, and even choose relaxing background themes. Stay mindful with progress notifications that keep you gently on track. Detailed reports show how you spend time each day. Whether you're a student, professional, or freelancer, Focusly helps you achieve more with less stress. Sync your data securely across devices. Experience productivity that feels natural, not forced.",
    "size": "48 MB",
    "reviews": "12.5K",
    "ratingAvg": 4.6,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 320 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 8493 }
    ]
  },
  {
    "image": "https://image.winudf.com/v2/image1/Y29tLnNuYXBtaXgucGhvdG9lZGl0b3Jfc2NyZWVuXzFfMTY5OTAxMTUzNV8wOTA/screen-1.jpg?fakeurl=1&type=.jpg",
    "title": "SnapMix: Photo Editor",
    "companyName": "PixelCraft Studios",
    "id": 2,
    "description": "SnapMix brings professional photo editing tools right to your fingertips. With one tap, you can remove backgrounds, adjust lighting, and enhance portraits using AI-powered tools. Choose from hundreds of filters, textures, and overlays to give your photos a unique touch. The collage maker helps you blend memories creatively. Retouch selfies naturally without losing detail. SnapMix supports both RAW and HD image formats for photographers who need more control. The user-friendly interface ensures you spend less time editing and more time creating. You can share instantly to social media or save in high quality. Transform everyday pictures into stunning works of art effortlessly.",
    "size": "95 MB",
    "reviews": "78.3K",
    "ratingAvg": 4.3,
    "downloads": "5.2M",
    "ratings": [
      { "name": "1 star", "count": 3120 },
      { "name": "2 star", "count": 4120 },
      { "name": "3 star", "count": 9100 },
      { "name": "4 star", "count": 17100 },
      { "name": "5 star", "count": 44981 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1563986768494-4dee2763ff3f",
    "title": "FitTrack: Health & Steps",
    "companyName": "ActiveNow",
    "id": 3,
    "description": "FitTrack is your ultimate health companion designed to keep you active and aware. It tracks steps, calories burned, and sleep quality, giving you detailed insights into your daily habits. With automatic reminders, you’ll never forget to drink water or stretch again. The intuitive dashboard helps visualize your progress using colorful graphs. Set fitness goals and monitor your journey towards a healthier lifestyle. FitTrack integrates seamlessly with smartwatches and health apps for more accurate results. Get personalized tips to improve your diet and routine. The app also offers motivational challenges and badges to keep you engaged. Stay fit, stay focused, and celebrate every step forward.",
    "size": "64 MB",
    "reviews": "24.8K",
    "ratingAvg": 4.7,
    "downloads": "2.6M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 5400 },
      { "name": "5 star", "count": 16692 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1558655146-d09347e92766",
    "title": "NoteFlow: Smart Notepad",
    "companyName": "AlphaByte Tech",
    "id": 4,
    "description": "NoteFlow is a modern note-taking app built for thinkers, creators, and learners. Capture your thoughts instantly using text, voice, or images. Organize your notes with folders, tags, and smart search. The minimalist interface helps you focus on writing, not formatting. Sync notes securely across your devices using cloud backup. With dark mode, distraction-free writing, and AI-powered suggestions, NoteFlow adapts to your work style. You can also lock private notes for extra security. It’s perfect for journaling, project planning, or daily to-dos. Export your notes in multiple formats and share them easily. Make every idea count with NoteFlow.",
    "size": "40 MB",
    "reviews": "18.5K",
    "ratingAvg": 4.5,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 650 },
      { "name": "2 star", "count": 820 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 10190 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQyIPoGHu2LpI5djU0vgEi3sxH4Nf4g7cNrwQ&s",
    "title": "Soundify: Music Streamer",
    "companyName": "WaveTech Media",
    "id": 5,
    "description": "Soundify gives you access to millions of songs from artists around the world. Create your own playlists or explore curated mixes for every mood. Enjoy crystal-clear sound with lossless audio support. The adaptive streaming feature adjusts to your connection speed automatically. Discover new artists with daily recommendations powered by AI. You can download your favorite tracks for offline listening anytime. Soundify’s sleep timer and equalizer let you personalize your listening experience. Connect with friends and share playlists instantly. With no ads and a smooth interface, it’s the perfect companion for music lovers. Tune in, relax, and feel the rhythm.",
    "size": "128 MB",
    "reviews": "96.5K",
    "ratingAvg": 4.4,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 7400 },
      { "name": "2 star", "count": 9200 },
      { "name": "3 star", "count": 15100 },
      { "name": "4 star", "count": 26300 },
      { "name": "5 star", "count": 38542 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1611605698335-8b1569810432",
    "title": "EduPath: Learn Anything",
    "companyName": "NextGen Learning",
    "id": 6,
    "description": "EduPath transforms learning into a fun, interactive experience. Explore a vast library of courses across technology, business, art, and more. Watch short, engaging video lessons created by experts. Practice coding challenges and take quizzes to test your knowledge. Track your progress and earn badges as you improve. EduPath adapts lessons to your learning speed using smart AI. Join discussion groups to learn collaboratively with others. The offline mode ensures you can study anytime, anywhere. Teachers can create and share custom learning paths easily. With EduPath, you’re not just learning—you’re mastering your passion.",
    "size": "85 MB",
    "reviews": "45.6K",
    "ratingAvg": 4.8,
    "downloads": "3.3M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 3400 },
      { "name": "4 star", "count": 7300 },
      { "name": "5 star", "count": 32970 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1556742044-3c52d6e88c62",
    "title": "TaskMate: To-Do & Planner",
    "companyName": "PlanIt Labs",
    "id": 7,
    "description": "TaskMate is your personal productivity partner that simplifies your daily life. Create tasks, set reminders, and organize projects in one place. The calendar view helps you visualize deadlines clearly. Group related tasks together and track progress with color-coded priorities. TaskMate supports both personal and professional use, from shopping lists to team projects. Receive smart suggestions to improve time management. Sync your tasks seamlessly across all devices with cloud backup. You can even add voice commands for quick input. Minimal design keeps you focused without clutter. Stay organized, stay ahead, and make every day productive with TaskMate.",
    "size": "52 MB",
    "reviews": "21.1K",
    "ratingAvg": 4.2,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 3100 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 9354 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c",
    "title": "DevSync: Code on the Go",
    "companyName": "Codeverse Inc.",
    "id": 8,
    "description": "Write, edit, and deploy code right from your phone with Git integration and syntax highlighting. DevSync brings a full coding experience on mobile, allowing you to manage repositories, collaborate with teammates, and push commits easily. It supports multiple programming languages, built-in terminal, and AI-powered code suggestions for faster development.",
    "size": "110 MB",
    "reviews": "19.2K",
    "ratingAvg": 4.9,
    "downloads": "0.9M",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 230 },
      { "name": "3 star", "count": 720 },
      { "name": "4 star", "count": 2900 },
      { "name": "5 star", "count": 15134 }
    ]
  },
  {
    "id": 9,
    "image": "https://cdn-icons-png.flaticon.com/512/2504/2504929.png",
    "title": "SnapPic",
    "companyName": "PixelSoft Ltd.",
    "description": "Edit and share photos with professional filters, AI enhancements, and easy one-tap effects. SnapPic includes background remover, portrait touch-up, and collage maker features. It’s perfect for social media creators who want stunning visuals in seconds, all inside a smooth, modern interface.",
    "size": "42.3 MB",
    "reviews": "815K",
    "ratingAvg": 4.6,
    "downloads": "5.2M",
    "ratings": [
      { "name": "1 star", "count": 420 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2300 },
      { "name": "4 star", "count": 8200 },
      { "name": "5 star", "count": 21200 }
    ]
  },
  {
    "id": 10,
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968841.png",
    "title": "TaskFlow",
    "companyName": "NextLogic Inc.",
    "description": "TaskFlow helps you organize your daily to-do lists, track deadlines, and manage goals with ease. It includes progress tracking, smart reminders, and team collaboration. With calendar view and priority filters, it’s built for both individuals and businesses to stay focused and productive.",
    "size": "58.7 MB",
    "reviews": "674K",
    "ratingAvg": 4.3,
    "downloads": "3.9M",
    "ratings": [
      { "name": "1 star", "count": 520 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 6400 },
      { "name": "5 star", "count": 17400 }
    ]
  },
  {
    "id": 11,
    "image": "https://cdn-icons-png.flaticon.com/512/732/732200.png",
    "title": "NoteMaster",
    "companyName": "WriteLab Co.",
    "description": "NoteMaster is a simple yet powerful note-taking app with a minimalist design. You can organize notes with tags, sync across devices, and access them offline. It supports markdown formatting, dark mode, and auto-save to prevent data loss, making writing faster and smoother.",
    "size": "29.8 MB",
    "reviews": "511K",
    "ratingAvg": 4.7,
    "downloads": "6.1M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 4800 },
      { "name": "5 star", "count": 19500 }
    ]
  },
  {
    "id": 12,
    "image": "https://cdn-icons-png.flaticon.com/512/906/906343.png",
    "title": "FitTrack",
    "companyName": "Healthify Team",
    "description": "FitTrack helps you monitor workouts, track calories, and set fitness goals. It includes step counter, heart rate tracking, and progress analytics. You can also sync data with smartwatches and get AI-generated workout recommendations for better health improvement.",
    "size": "66.2 MB",
    "reviews": "958K",
    "ratingAvg": 4.5,
    "downloads": "8.7M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 3200 },
      { "name": "4 star", "count": 9900 },
      { "name": "5 star", "count": 25100 }
    ]
  },
  {
    "id": 13,
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968872.png",
    "title": "NewsPulse",
    "companyName": "DailyStream Media",
    "description": "Stay informed with real-time global news updates, breaking headlines, and live coverage. NewsPulse offers personalized feeds based on your interests and reliable sources. The app includes offline mode, notification alerts, and a smooth reading experience for busy users.",
    "size": "45.1 MB",
    "reviews": "780K",
    "ratingAvg": 4.2,
    "downloads": "4.8M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 7900 },
      { "name": "5 star", "count": 20400 }
    ]
  },
  {
    "id": 14,
    "image": "https://cdn-icons-png.flaticon.com/512/1006/1006771.png",
    "title": "CookMate",
    "companyName": "Foodify Labs",
    "description": "Discover thousands of recipes, step-by-step cooking tutorials, and video guides. CookMate lets you save your favorite dishes, generate shopping lists, and follow chefs worldwide. It also supports voice-guided instructions and dietary filters like vegan or keto.",
    "size": "52.4 MB",
    "reviews": "620K",
    "ratingAvg": 4.8,
    "downloads": "7.5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 7200 },
      { "name": "5 star", "count": 25600 }
    ]
  },
  {
    "id": 15,
    "image": "https://play-lh.googleusercontent.com/rJaXm_Owjbz7T52kyrjjeAxLlnCgfQONhKi15Z8ksDz5ZCN24WmzhFfWZcPoSiFs4CCHpEWJ2WBpVI4UTjgYTQ",
    "title": "LangLearn",
    "companyName": "GlobalLingua",
    "description": "LangLearn is an interactive language learning app that makes acquiring new languages fun and engaging. It offers structured lessons for beginners to advanced learners. The app includes quizzes, flashcards, and listening exercises to improve comprehension. Users can track their progress and earn rewards for milestones. It supports multiple languages, allowing you to switch between them easily. Conversation practice is encouraged through interactive exercises. You can learn at your own pace with short daily lessons. The app also includes cultural notes to enhance understanding. Gamified challenges keep you motivated and engaged. Suitable for students, travelers, and language enthusiasts alike.",
    "size": "61.9 MB",
    "reviews": "1110K",
    "ratingAvg": 4.6,
    "downloads": "9.4M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2300 },
      { "name": "4 star", "count": 8400 },
      { "name": "5 star", "count": 27600 }
    ]
  },
  {
    "id": 16,
    "image": "https://cdn-icons-png.flaticon.com/512/2111/2111646.png",
    "title": "Musicify",
    "companyName": "SoundWave Studio",
    "description": "Musicify allows you to stream and download millions of songs anytime, anywhere. Explore playlists curated for every mood and genre. The app features offline listening, so you can enjoy music without internet. Create and share your own playlists with friends. Discover new artists and trending tracks daily. Musicify provides high-quality audio streaming for an immersive experience. Personalized recommendations help you find songs you’ll love. Enjoy radio channels, podcasts, and exclusive live sessions. The app has an intuitive interface for easy navigation. Regular updates bring new features and improve performance. Perfect for music lovers who want a complete audio experience.",
    "size": "70.5 MB",
    "reviews": "2150K",
    "ratingAvg": 4.9,
    "downloads": "12.6M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 9600 },
      { "name": "5 star", "count": 33400 }
    ]
  },
  {
    "id": 17,
    "image": "https://cdn-icons-png.flaticon.com/512/5968/5968705.png",
    "title": "Weatherly",
    "companyName": "SkyCast Systems",
    "description": "Weatherly provides accurate weather forecasts and real-time alerts. It shows detailed temperature, humidity, and wind data. The app features interactive radar maps for tracking storms and precipitation. Users receive severe weather notifications to stay safe. Daily and weekly forecasts help you plan ahead. The app also offers sunrise, sunset, and moon phase information. Weatherly supports multiple locations, allowing you to monitor weather anywhere. Its clean interface makes navigation easy and user-friendly. Historical weather data helps analyze patterns over time. The app is suitable for travelers, outdoor enthusiasts, and professionals. Regular updates ensure precise forecasting and new features.",
    "size": "38.9 MB",
    "reviews": "514K",
    "ratingAvg": 4.3,
    "downloads": "3.4M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 6400 },
      { "name": "5 star", "count": 17200 }
    ]
  },
  {
    "id": 18,
    "image": "https://cdn-icons-png.flaticon.com/512/906/906334.png",
    "title": "GameHub",
    "companyName": "Arcadia Labs",
    "description": "GameHub is your destination for discovering and playing trending games across all genres. It provides recommendations based on your gaming preferences. The app allows users to download and play games directly. Track achievements and compete with friends in leaderboards. Daily and weekly challenges keep the experience engaging. GameHub supports both casual and hardcore gamers with a wide variety of titles. Enjoy detailed game descriptions, screenshots, and ratings before playing. The app includes social features for sharing progress and inviting friends. Regular updates introduce new games and features. It’s designed to run smoothly on a wide range of devices. Perfect for gamers seeking variety and community.",
    "size": "95.3 MB",
    "reviews": "1890K",
    "ratingAvg": 4.7,
    "downloads": "15.8M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1700 },
      { "name": "3 star", "count": 3400 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 38200 }
    ]
  },
  {
    "id": 19,
    "image": "https://cdn-icons-png.flaticon.com/512/732/732221.png",
    "title": "FinancePro",
    "companyName": "MoneyWorks",
    "description": "FinancePro helps you manage expenses, income, and budgets efficiently. Track all your transactions in one place and categorize them easily. The app offers visual charts and reports for better financial insight. Set budgets and get alerts when you approach limits. Users can create savings goals and track progress. FinancePro supports multiple accounts and currencies. The app includes bill reminders to avoid late payments. Secure login ensures privacy and data safety. Financial tips and guides help improve your money management skills. Sync data across devices for consistent tracking. Ideal for individuals and small businesses wanting financial control.",
    "size": "41.6 MB",
    "reviews": "780K",
    "ratingAvg": 4.4,
    "downloads": "6.2M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 7700 },
      { "name": "5 star", "count": 23100 }
    ]
  },
  {
    "id": 20,
    "image": "https://cdn6.aptoide.com/imgs/8/1/1/8118255b996eb7d0a88ebb041cd84da0_icon.png",
    "title": "MovieBox",
    "companyName": "CineVerse Studios",
    "description": "MovieBox lets you stream trending movies, TV shows, and series on any device. Discover new releases and classic favorites effortlessly. The app offers high-quality video playback and subtitles. Create watchlists and mark favorites to stay organized. MovieBox supports offline downloads for viewing without internet. Personalized recommendations make finding content easy. Users can share reviews and ratings to help others. The app includes notifications for upcoming releases and premieres. Regularly updated with new content to keep entertainment fresh. The interface is user-friendly and responsive. Perfect for cinema lovers and binge-watchers who want entertainment on the go.",
    "size": "89.1 MB",
    "reviews": "1950K",
    "ratingAvg": 4.9,
    "downloads": "17.5M",
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 1600 },
      { "name": "3 star", "count": 3700 },
      { "name": "4 star", "count": 11500 },
      { "name": "5 star", "count": 40200 }
    ]
  }
]
